Repository: leriomaggio/code-coherence-evaluation-tool
Catalog: code_comments_coherence/locale/*/LC_MESSAGES/django.po
Languages: it

source: Agreement_Evaluations
it: Valutazione Accordo tra Commenti e Codice

source: agreement_evaluations
it: Valutazione Accordo tra Commenti e Codice

source: English
it: Inglese

source: Italian
it: Italiano

source: Source_Code_Analysis
it: Dati di Analisi del Codice

source: source_code_analysis
it: Dati di Analisi del Codice

source: The generation of the code base of 1 Project has been started and will be completed shortly. Please hold on a few minutes and refresh this page to check for updates.
it: Il processo di generazione della Code Base per 1 Progetto è stato avviato e sarà completato in breve tempo. Per favore, attendi qualche minuto e riaggiorna la pagina per verificarne il completamento.

source: The generation of the code base of %d Projects have been started and will be completed shortly. Please hold on a few minutes and refresh this page to check for updates.
it: Il processo di generazione della Code Base per %d Progetti è stato avviato e sarà completato in breve tempo. Per favore, attendi qualche minuto e riaggiorna la pagina per verificarne il completamento.

source: 1 selected Software Project has
it: 1 Progetto Software selezionato è

source: %d selected Software Projects have
it: %d Progetti Software selezionati sono

source: %s been ignored since the corresponding Code Base was not empty!
it: %s è stato ignorato dato che la corrispondente Code Base non era vuota!

source: Generate Code Base
it: Genera Code Base

source: Code Files for 1 Project are being generated. Please hold on a while and refresh this page to check for updates.
it: I File Sorgente di 1 Progetto stanno per essere generati. Per favore, attendere qualche istante e riaggiornare la pagina per verificarne il completamento.

source: Code Files for %d Project are being generated. Please hold on a while and refresh this page to check for updates.
it: I File Sorgente di %d Progetti stanno per essere generati. Per favore, attendere qualche istante e riaggiornare la pagina per verificarne il completamento.

source: %s been ignored since the content of corresponding decompressed archive has not been found
it: %s è stato ignorato dato che il contenuto del corrispondente archivio decompresso non è stato trovato

source: Fetch Code Files
it: Acquisisci File Sorgente

source: Project Code Base Statistics
it: Statistiche della Code Base

source: Project Website
it: Sito Web del Progetto

source: The code analysis process is now working in background. Please check in a few moments
it: Il processo di analisi del codice è avviato in background. Per favore, ricontrolla tra pochi minuti.

source: Lines of Code
it: Linee di Codice

source: Code Fragment
it: Frammento di Codice

source: Code Comment
it: Commento

source: <b>Source File not found in the DB</b>
it: <b>File Sorgente non trovato nel DB</b>

source: Source File
it: File Sorgente

source: Method Code
it: Metodo

source: Method Comment
it: Commento del Metodo

source: Class Code
it: Classe

source: Class Comment
it: Commento della Classe

source: Class
it: Classe

source: Number of Methods
it: Numero di Metodi

source: Method
it: Metodo

source: Code-Comments Evaluation
it: Valutazione Codice-Commenti

source: Method Information
it: Informazioni del Metodo

source: Comment
it: Commento

source: Are you not sure enough? <br><br> Please take a look at the
it: Hai qualche dubbio? <br><br> Alora puoi dare una occhiata al

source: Code file for %s method
it: File Sorgente per il metodo %s

source: for the method
it: per il metodo

source: What is the agreement rate between this Comment and corresponding Method code?
it: Qual è il grado di accordo tra il Commento e il corrispondente codice del Metodo?

source: Error in Association
it: Associazione Errata

source: Agreement
it: Accordo

source: The input file is not a valid Compressed Archive
it: Il file di input non è un archivio compresso valido

source: The Input file is not a valid Compressed Archive
it: Il file di input non è un archivio compresso valido

source: Method name
it: Nome del Metodo

source: Start line
it: Prima riga

source: End line
it: Ultima riga

source: Project
it: Progetto

source: Code Class
it: Classe

source: Evaluated
it: Già Valutato

source: All
it: Tutti

source: False
it: No

source: True
it: Si

source: Evaluator
it: Valutatore

source: Agreement Vote
it: Accordo

source: Project Name
it: Nome del Progetto

source: Project Version
it: versione del Progetto

source: Project URL
it: URL del Progetto

source: Source Folder Path
it: Percorso della Cartella contentente i File Sorgente

source: Path on server where source code files have been extracted.
it: Percorso sul server nel quale l'archivio compresso è stato estratto.

source: The main programming language of the Software system. <br> Please note that so far, only the <b>Java</b> language analysis is supported.
it: Il Linguaggio di Programmazione "principale" del Progetto Software. <br> Si noti che al momento, è supportata l'analisi del solo linguaggio <b>Java</b>.

source: Programming Language
it: Linguaggio di Programmazione

source: Software Project
it: Progetto Software

source: Software Projects
it: Progetti Software

source: Source file Path
it: Percorso del File Sorgente

source: Path on server where source code file has been saved.
it: Percorso sul server dove i File Sorgente sono stati salvati.

source: Source Code Text
it: Codice Sorgente

source: Source Code File
it: File Sorgente

source: Source Code Files
it: File Sorgente

source: Filepath
it: Percorso del File

source: End Line
it: Ultima riga

source: AST
it: AST (Abstract Syntax Tree)

source: Class Name
it: Nome della Classe

source: Classes
it: Classi

source: Method Name
it: Nome del Metodo

source: Methods
it: Metodi

source: Evaluation Created on
it: Valutazione effettuata il

source: Last Update
it: Ultimo Aggiornamento

source: Evaluated on
it: Valutato il

source: Evaluation
it: Valutazione

source: Evaluations
it: Valutazioni

source: Evaluation to be Checked
it: Valutazione da Revisionare

source: Evaluations to be Checked
it: Valutazioni da Revisionare

source: Strong Disagreement
it: Forte Disaccordo

source: Strong Agreement
it: Forte Accordo

source: Don't Know
it: Non so

source: Disagreement
it: Disaccordo

source: To Be Checked
it: Da Revisionare

source: Filter by
it: Filtra per

source: Apply the filter
it: Applica i filtri

source: Apply Filters
it: Applica i filtri

source: Code Comments Evaluation Platform
it: Applicazione di Valutazione tra Codice e Commenti

source: Switch to Language
it: Imposta la lingua

source: Go
it: Vai
